-- MySQL dump 10.13  Distrib 5.7.12, for Win64 (x86_64)
--
-- Host: 192.168.0.249    Database: zxshop
-- ------------------------------------------------------
-- Server version	5.7.12

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `order_logs`
--

DROP TABLE IF EXISTS `order_logs`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `order_logs` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT COMMENT '订单id',
  `order_id` int(11) NOT NULL COMMENT '订单ID',
  `user` int(11) NOT NULL COMMENT '用户ID',
  `identity` varchar(255) COLLATE utf8_unicode_ci NOT NULL COMMENT '身份',
  `platform` varchar(20) COLLATE utf8_unicode_ci NOT NULL COMMENT '用户是否是平台用户',
  `log` varchar(255) COLLATE utf8_unicode_ci NOT NULL COMMENT '日志',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `status` int(11) DEFAULT NULL,
  `msg` varchar(45) COLLATE utf8_unicode_ci DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=98 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `order_logs`
--

LOCK TABLES `order_logs` WRITE;
/*!40000 ALTER TABLE `order_logs` DISABLE KEYS */;
INSERT INTO `order_logs` VALUES (1,1,44,'普通用户','用户端APP','创建订单','2016-07-06 14:16:04','2016-07-06 14:16:04',11,NULL),(2,1,44,'普通用户','用户端APP','支付订单成功','2016-07-06 14:16:17','2016-07-06 14:16:17',2,NULL),(3,1,44,'商家管理员','手机端','将订单1的状态改为4','2016-07-06 14:17:23','2016-07-06 14:17:23',4,NULL),(4,1,44,'商家管理员','手机端','将订单1的状态改为5','2016-07-06 14:17:25','2016-07-06 14:17:25',5,NULL),(5,2,73,'普通用户','用户端APP','创建订单','2016-07-07 00:15:04','2016-07-07 00:15:04',11,NULL),(6,2,73,'普通用户','用户端APP','支付订单成功','2016-07-07 00:15:20','2016-07-07 00:15:20',2,NULL),(7,2,73,'商家管理员','手机端','将订单2的状态改为4','2016-07-07 00:16:30','2016-07-07 00:16:30',4,NULL),(8,2,73,'商家管理员','手机端','将订单2的状态改为5','2016-07-07 00:16:36','2016-07-07 00:16:36',5,NULL),(9,3,73,'普通用户','用户端APP','创建订单','2016-07-07 00:57:10','2016-07-07 00:57:10',11,NULL),(10,3,73,'普通用户','用户端APP','支付订单成功','2016-07-07 00:57:24','2016-07-07 00:57:24',2,NULL),(11,4,72,'普通用户','用户端APP','创建订单','2016-07-07 00:58:01','2016-07-07 00:58:01',11,NULL),(12,4,72,'普通用户','用户端APP','支付订单成功','2016-07-07 00:58:14','2016-07-07 00:58:14',2,NULL),(13,5,73,'普通用户','用户端APP','创建订单','2016-07-07 00:59:38','2016-07-07 00:59:38',11,NULL),(14,5,73,'普通用户','用户端APP','支付订单成功','2016-07-07 00:59:46','2016-07-07 00:59:46',2,NULL),(15,5,73,'普通用户','用户端APP','订单申请退款','2016-07-07 00:59:58','2016-07-07 00:59:58',13,NULL),(16,4,72,'商家管理员','手机端','将订单4的状态改为4','2016-07-07 01:48:17','2016-07-07 01:48:17',4,NULL),(17,4,72,'商家管理员','手机端','将订单4的状态改为5','2016-07-07 01:48:33','2016-07-07 01:48:33',5,NULL),(18,6,73,'普通用户','用户端APP','创建订单','2016-07-07 02:03:59','2016-07-07 02:03:59',11,NULL),(19,6,73,'普通用户','用户端APP','支付订单成功','2016-07-07 02:04:16','2016-07-07 02:04:16',2,NULL),(20,7,45,'普通用户','用户端APP','创建订单','2016-07-07 02:05:39','2016-07-07 02:05:39',11,NULL),(21,7,45,'普通用户','用户端APP','支付订单成功','2016-07-07 02:05:50','2016-07-07 02:05:50',2,NULL),(22,7,45,'商家管理员','手机端','将订单7的状态改为4','2016-07-07 02:06:01','2016-07-07 02:06:01',4,NULL),(23,7,45,'商家管理员','手机端','将订单7的状态改为5','2016-07-07 02:06:06','2016-07-07 02:06:06',5,NULL),(24,7,45,'普通用户','用户端APP','订单申请退款','2016-07-07 02:06:32','2016-07-07 02:06:32',13,NULL),(25,7,0,'商家管理员','手机端','将订单7的状态改为14','2016-07-07 02:06:41',NULL,14,NULL),(26,8,44,'普通用户','用户端APP','创建订单','2016-07-07 03:21:07','2016-07-07 03:21:07',11,NULL),(27,9,44,'普通用户','用户端APP','创建订单','2016-07-07 03:21:15','2016-07-07 03:21:15',11,NULL),(28,10,3,'普通用户','用户端APP','创建订单','2016-07-07 04:30:13','2016-07-07 04:30:13',11,NULL),(29,10,3,'普通用户','用户端APP','支付订单成功','2016-07-07 04:31:00','2016-07-07 04:31:00',2,NULL),(30,10,3,'普通用户','用户端APP','订单申请退款','2016-07-07 05:10:54','2016-07-07 05:10:54',13,NULL),(31,10,0,'商家管理员','手机端','将订单10的状态改为14','2016-07-07 05:14:49',NULL,14,NULL),(32,11,2,'普通用户','用户端APP','创建订单','2016-07-07 07:13:01','2016-07-07 07:13:01',11,NULL),(33,11,2,'普通用户','用户端APP','支付订单成功','2016-07-07 07:13:28','2016-07-07 07:13:28',2,NULL),(34,6,73,'商家管理员','手机端','将订单6的状态改为4','2016-07-07 07:20:47','2016-07-07 07:20:47',4,NULL),(35,3,73,'商家管理员','手机端','将订单3的状态改为4','2016-07-07 07:20:48','2016-07-07 07:20:48',4,NULL),(36,6,73,'商家管理员','手机端','将订单6的状态改为5','2016-07-07 07:21:00','2016-07-07 07:21:00',5,NULL),(37,3,73,'商家管理员','手机端','将订单3的状态改为5','2016-07-07 07:21:01','2016-07-07 07:21:01',5,NULL),(38,12,5,'普通用户','用户端APP','创建订单','2016-07-07 07:26:49','2016-07-07 07:26:49',11,NULL),(39,13,5,'普通用户','用户端APP','创建订单','2016-07-07 07:39:06','2016-07-07 07:39:06',11,NULL),(40,14,5,'普通用户','用户端APP','创建订单','2016-07-07 07:45:23','2016-07-07 07:45:23',11,NULL),(41,15,5,'普通用户','用户端APP','创建订单','2016-07-07 07:47:41','2016-07-07 07:47:41',11,NULL),(42,11,2,'商家管理员','手机端','将订单11的状态改为4','2016-07-07 08:20:55','2016-07-07 08:20:55',4,NULL),(43,11,2,'商家管理员','手机端','将订单11的状态改为5','2016-07-07 08:21:08','2016-07-07 08:21:08',5,NULL),(44,16,5,'普通用户','用户端APP','创建订单','2016-07-07 08:23:22','2016-07-07 08:23:22',11,NULL),(45,17,5,'普通用户','用户端APP','创建订单','2016-07-07 08:34:10','2016-07-07 08:34:10',11,NULL),(46,17,5,'普通用户','用户端APP','支付订单成功','2016-07-07 08:34:44','2016-07-07 08:34:44',2,NULL),(47,17,5,'商家管理员','手机端','将订单17的状态改为4','2016-07-07 08:35:10','2016-07-07 08:35:10',4,NULL),(48,17,5,'商家管理员','手机端','将订单17的状态改为5','2016-07-07 08:35:29','2016-07-07 08:35:29',5,NULL),(49,17,5,'普通用户','用户端APP','订单申请退款','2016-07-07 08:35:47','2016-07-07 08:35:47',13,NULL),(50,17,0,'商家管理员','手机端','将订单17的状态改为14','2016-07-07 08:36:00',NULL,14,NULL),(51,18,9,'普通用户','用户端APP','创建订单','2016-07-08 02:57:59','2016-07-08 02:57:59',11,NULL),(52,19,9,'普通用户','用户端APP','创建订单','2016-07-08 03:08:34','2016-07-08 03:08:34',11,NULL),(53,20,9,'普通用户','用户端APP','创建订单','2016-07-08 03:09:06','2016-07-08 03:09:06',11,NULL),(54,21,9,'普通用户','用户端APP','创建订单','2016-07-08 03:09:13','2016-07-08 03:09:13',11,NULL),(55,22,9,'普通用户','用户端APP','创建订单','2016-07-08 03:09:42','2016-07-08 03:09:42',11,NULL),(56,23,2,'普通用户','用户端APP','创建订单','2016-07-08 04:06:33','2016-07-08 04:06:33',11,NULL),(57,24,5,'普通用户','用户端APP','创建订单','2016-07-08 07:39:36','2016-07-08 07:39:36',11,NULL),(58,25,5,'普通用户','用户端APP','创建订单','2016-07-08 07:40:06','2016-07-08 07:40:06',11,NULL),(59,26,5,'普通用户','用户端APP','创建订单','2016-07-08 07:50:07','2016-07-08 07:50:07',11,NULL),(60,27,5,'普通用户','用户端APP','创建订单','2016-07-08 07:50:54','2016-07-08 07:50:54',11,NULL),(61,28,5,'普通用户','用户端APP','创建订单','2016-07-08 07:54:19','2016-07-08 07:54:19',11,NULL),(62,29,5,'普通用户','用户端APP','创建订单','2016-07-08 08:07:52','2016-07-08 08:07:52',11,NULL),(63,30,5,'普通用户','用户端APP','创建订单','2016-07-08 08:28:11','2016-07-08 08:28:11',11,NULL),(64,31,1,'普通用户','用户端APP','创建订单','2016-07-11 08:46:42','2016-07-11 08:46:42',11,NULL),(65,32,1,'普通用户','用户端APP','创建订单','2016-07-11 08:55:56','2016-07-11 08:55:56',11,NULL),(66,33,1,'普通用户','用户端APP','创建订单','2016-07-11 09:02:36','2016-07-11 09:02:36',11,NULL),(67,34,1,'普通用户','用户端APP','创建订单','2016-07-11 09:03:04','2016-07-11 09:03:04',11,NULL),(68,35,1,'普通用户','用户端APP','创建订单','2016-07-11 09:05:38','2016-07-11 09:05:38',11,NULL),(69,36,5,'普通用户','用户端APP','创建订单','2016-07-11 09:17:19','2016-07-11 09:17:19',11,NULL),(70,37,1,'普通用户','用户端APP','创建订单','2016-07-11 09:17:20','2016-07-11 09:17:20',11,NULL),(71,38,5,'普通用户','用户端APP','创建订单','2016-07-11 09:24:26','2016-07-11 09:24:26',11,NULL),(72,39,5,'普通用户','用户端APP','创建订单','2016-07-11 09:25:40','2016-07-11 09:25:40',11,NULL),(73,40,5,'普通用户','用户端APP','创建订单','2016-07-11 09:25:56','2016-07-11 09:25:56',11,NULL),(74,41,1,'普通用户','用户端APP','创建订单','2016-07-11 09:38:17','2016-07-11 09:38:17',11,NULL),(75,41,1,'普通用户','用户端APP','支付订单成功','2016-07-11 09:38:31','2016-07-11 09:38:31',2,NULL),(76,41,1,'普通用户','用户端APP','订单申请退款','2016-07-11 09:41:54','2016-07-11 09:41:54',13,NULL),(77,41,0,'商家管理员','手机端','将订单41的状态改为14','2016-07-11 09:43:26',NULL,14,NULL),(78,42,1,'普通用户','用户端APP','创建订单','2016-07-11 09:43:36','2016-07-11 09:43:36',11,NULL),(79,43,1,'普通用户','用户端APP','创建订单','2016-07-11 09:44:20','2016-07-11 09:44:20',11,NULL),(80,44,1,'普通用户','用户端APP','创建订单','2016-07-11 09:52:13','2016-07-11 09:52:13',11,NULL),(81,45,1,'普通用户','用户端APP','创建订单','2016-07-11 09:53:19','2016-07-11 09:53:19',11,NULL),(82,45,1,'普通用户','用户端APP','支付订单成功','2016-07-11 09:53:34','2016-07-11 09:53:34',2,NULL),(83,45,1,'普通用户','用户端APP','订单申请退款','2016-07-11 09:53:45','2016-07-11 09:53:45',13,NULL),(84,45,0,'商家管理员','手机端','将订单45的状态改为14','2016-07-11 09:54:20',NULL,14,NULL),(85,46,1,'普通用户','用户端APP','创建订单','2016-07-11 09:55:03','2016-07-11 09:55:03',11,NULL),(86,46,1,'普通用户','用户端APP','支付订单成功','2016-07-11 09:56:34','2016-07-11 09:56:34',2,NULL),(87,46,1,'普通用户','用户端APP','订单申请退款','2016-07-11 09:56:48','2016-07-11 09:56:48',13,NULL),(88,46,0,'商家管理员','手机端','将订单46的状态改为14','2016-07-11 09:56:59',NULL,14,NULL),(89,47,5,'普通用户','用户端APP','创建订单','2016-07-12 01:23:07','2016-07-12 01:23:07',11,NULL),(90,47,5,'普通用户','用户端APP','支付订单成功','2016-07-12 01:23:24','2016-07-12 01:23:24',2,NULL),(91,47,5,'商家管理员','手机端','将订单47的状态改为4','2016-07-12 01:59:09','2016-07-12 01:59:09',4,NULL),(92,47,5,'商家管理员','手机端','将订单47的状态改为5','2016-07-12 02:03:04','2016-07-12 02:03:04',5,NULL),(93,47,5,'普通用户','用户端APP','订单申请退款','2016-07-12 02:04:54','2016-07-12 02:04:54',13,NULL),(94,47,0,'商家管理员','手机端','将订单47的状态改为14','2016-07-12 02:05:51',NULL,14,NULL),(95,48,2,'普通用户','用户端APP','创建订单','2016-07-13 07:09:59','2016-07-13 07:09:59',11,NULL),(96,49,2,'普通用户','用户端APP','创建订单','2016-07-13 07:10:12','2016-07-13 07:10:12',11,NULL),(97,50,2,'普通用户','用户端APP','创建订单','2016-07-13 07:55:46','2016-07-13 07:55:46',11,NULL);
/*!40000 ALTER TABLE `order_logs` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2016-08-18  8:50:36
